fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ВКМ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Сотрудники</name>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорияСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НикВТелеграмм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВКМ_КатегорияСотрудника/ВКМ_КатегорияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорияСотрудника</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПесонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ФормыСлужебныйКлиент.УстановитьВидимостьЭлементовФормы(Элементы.ПроцентОтРабот, 
																Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист"));	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	
	ВКМ_ФормыСлужебныйКлиент.УстановитьВидимостьЭлементовФормы(Элементы.ПроцентОтРабот, 
																Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист"));	
	
	Если Объект.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.АдминистративныйПесонал") Тогда
		Объект.ПроцентОтРабот = 0;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
